app/views/recipes/show.html.erb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = 1
---
<ul id='ingredients'>
  <% @recipe.ingredients.each do |ingredient| %>