app/controllers/ingredients_controller.rb

  def create
    @ingredient = @recipe.ingredients.build(params[:ingredient])
    if @ingredient.save
---
INSERT INTO "ingredients" ("created_at", "description", "recipe_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    if @ingredient.update_attributes(params[:ingredient])
---
UPDATE "ingredients" SET "title" = 'Make it really shiny!', "description" = '

  def destroy
    @ingredient.destroy
---
DELETE FROM "ingredients" WHERE "ingredients"."id" = ?  [["id", 1]]

  def find_recipe
    @recipe = Recipe.find(params[:recipe_id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "1"]]

  def find_ingredient
    @ingredient = @recipe.ingredients.find(params[:id])
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = 1 AND "ingredients"."id" = ? LIMIT 1  [["id", "1"]]