app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 29 Jul 2013 03:06:58 UTC +00:00], ["description", "A text-editor for OS X"], ["name", "TextMate 2"], ["updated_at", Mon, 29 Jul 2013 03:06:58 UTC +00:00]]
---
  def create
  @recipe = Recipe.new(params[:recipe])
    if @recipe.save

UPDATE "recipes" SET "name" = 'TextMate 2 beta', "description" = '', "updated_at" = '2013-07-29 04:32:29.094938' WHERE "recipes"."id" = 1
---
  def update

    if @recipe.update_attributes(params[:recipe])

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def find_recipe
    @recipe = Recipe.find(params[:id])